{
  "mapques": {
    "MAIN YARD": {
      "descr1": "Magical bavarian castle with twin cones surrounded by meadows of forest.There are innate voices residing in this magical dorm.Pigeons holding on to the crevices of the towers and lamps lit by the sorceress spell blind the ceiling",
      "ques": "We are back to the main yard!",
      "event1": "As i glance around,I see something.In the mysterious ill - lit pastures,Ron Weasley practises his black magic...He intends to use it to defeat Draco Malfoy.I could help him carry out his revenge tour but professor would prefer me to alert him about this going on "
    },
    "SCHOOL": {
      "descr1": "Lined up with massive corridors,ceilings which run to the sky,libraries,labs and classrooms,this is the school of Hogwards",
      "ques": "Hermoine looks possesed with a magic spell.She approaches you and asks you  if I want to go to potions class to show some secret stuff.There might be some secrets there which I might not be ready to uncover yet."
    },
    "POTIONS CLASS": {
      "descr1": "This room is large enough to allow at least twenty students to work and its walls are lined with pickled animals in glass jars. In one corner of the room stands a basin into which ice-cold water poured from a gargoyle's mouth, while in another is a student supply cupboard.",
      "descr2": "Oh snap,theres an ugly filthy creature beside the cupboard and its panting heavily.It is rushing towards me.Fighting that creature looks difficult since it is ghostly.Maybe running is a possibility."
    },
    "DARK MAGIC DEFENSE": {
      "descr1": "Cabin smells like dried pigeon and sewer remains.There are skeletons everywhere and long magical staffs.The walls are lined up with ancestry posters and capes",
      "descr2": ""
    },
    "MAGIC CLASS": {
      "descr1": "The old smell of anchovies and wine.Ahead lies the stalls of magical capes and dragon art.This place has been home to several of the greatest magical apprentices like me",
      "descr2": ""
    },
    "DORM YARD": {
      "descr1": "Growing out of the green widows are  giant whomping willows and venomous tentacula.",
      "descr2": ""
    },
    "GYRFFIN DORM ": {
      "descr1": "There are six majestic beds lined up in a hexagon with a couch with the magic emblem.The closets smell of sweat and spells as the ceiling's tarantula creeps down.",
      "descr2": ""
    },
    "HOSPITAL": {
      "descr1": "Walls painted as dull as they can be,the room is filled with beds and magic potions.The red cross hangs proudly among the vast ceiling of this hospital",
      "descr2": ""
    },
    "SLYTHERIN DORM": {
      "descr1": "Possessed and cursed meadow with ravens growling at the top of their lungs.The swamps are dry and fishes venomous flying in the land.An evil mysterious breeze blows through.",
      "descr2": ""
    }
  }
}